taboadaa/ShuQi/nRF/Packages/.cache/Keil.Kinetis_KLxx_DFP.1.13.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>Kinetis_KLxx_DFP</name>
  <description>NXP Kinetis KLxx Series Device Support and Examples</description>

  <releases>
    <release version="1.13.0" date="2017-02-21">
      Reworked KLxx_DFP.
      - updated files for MKL17Z4, MKL27Z4, MKL33Z4, MKL43Z4
      - updated documentation.
      Updated device header files: added ARM Clang 6 directives for handling anonymous unions
    </release>
    <release version="1.12.0" date="2016-07-12">
      Reworked KLxx_DFP.
      - updated system_MKL*.c files for MKL03Z4, MKL17Z4, MKL27Z4, MKL33Z4, MKL43Z4
      - changed vendor to NXP.
      - updated documentation.
      - updated boards description.
      - changed device vendor to NXP in projects.
    </release>
    <release version="1.11.0" date="2016-04-14">
      Updated KL28Z device files.
      Removed device MKL28Z256xxx7 (according new reference manual).
      Updated Kinetis Flash Algorithm MK_P128_48MHZ.FLM.
       - corrected BlankCheck() function.
    </release>
    <release version="1.10.0" date="2016-02-05">
      Device Support:
      - updated MKL28Z flash algorithm
    </release>
    <release version="1.9.0" date="2015-12-01">
      Device Support:
      - updated MKL82Z7 device support description and files
      - updated KL25Z4 device support description and files
      Examples:
      - added TWR-KL43Z48M Example
      - updated FRDM-KL25Z Example
    </release>
    <release version="1.8.0" date="2015-11-12">
      Device Support:
      - added MKL26Z4      
      - updated MKL82Z7 device support
      - updated MKL device support files
      - updated MK_P128.FLM Flash Algorithm (using Cortex-M4).
      Examples:
      - added FRDM-KL82Z Example
      - added TWR-KL82Z72M Example.
    </release>
    <release version="1.7.0" date="2015-08-12">
      Added device support for MKL28Z7.
    </release>
    <release version="1.6.0" date="2015-05-04">
      Removed FRDM-KL33Z board support.
      Reworked FRDM-KL43Z board support.
    </release>
    <release version="1.5.0" date="2015-04-10">
      Added Device support for MKL13Z32, MKL13Z64, MKL33Z32, MKL33Z64.
      Added board support for FDRM-KL33Z.
      Added missing manuals.
    </release>
    <release version="1.4.0" date="2014-10-08">
      Updated CMSIS files for MKL17Z32, MKL17Z64, MKL27Z32, MKL27Z64.
      Added missing board descriptions.
      Added user manuals for KL17 and KL27 devices
    </release>
    <release version="1.3.0" date="2014-09-24">
      Added KL17, KL27 and KL33 devices
      Update to CMSIS-Core V 1.3 for KL17Z4, KL27Z4, KL33Z4 and KL43Z4
      SRAM range unified into single range
      Added FRDM-KL43Z board examples
    </release>
    <release version="1.2.0" date="2014-07-10">
      Updated KL03 startup file
      Updated KL03 flash algorithm
    </release>
    <release version="1.1.0">
      Updated KL03 CMSIS files
      Added FRDM-KL03Z Blinky example
    </release>
    <release version="1.0.1">
      Updated FRDM-KL25Z/RTX_Blinky example
    </release>
    <release version="1.0.0">
      First Release version of KL Device Family Pack.
    </release>
  </releases>

  <keywords>
  <!-- keywords for indexing -->
    <keyword>NXP</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package NXP</keyword>
    <keyword>KL</keyword>
  </keywords>

  <devices>
    <family Dfamily="KLxx Series" Dvendor="NXP:11">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p0"/>
      <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
      <book name="Documents/dui0662a_cortex_m0p_r0p0_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
      <description>
Kinetis L series MCUs, based on the ARM® Cortex®-M0+ core, offer ultra-low power and small size with scalable integration and ease-of-use.
      </description>

      <!-- ******************************  KL0x  ******************************** -->
      <subFamily DsubFamily="KL0x">
        <description>
The Kinetis KL0 MCU family is the entry point into the Kinetis L series based on the ARM® Cortex®-M0+ core.
The KL0 ultra-low-power MCUs provide a bridge for 8-bit customers migrating into the Kinetis portfolio and is software and tool compatible with all other Kinetis L series devices.
        </description>

        <!-- ******************************  MKL02Z8xxx4  ****************************** -->
        <device Dname="MKL02Z8xxx4">
          <compile header="Device/Include/MKL02Z4.h" define="MKL02Z8xxx4"/>
          <debug svd="SVD/MKL02Z4.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x1FFFFF00" size="0x00000400" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P8_48MHZ.FLM" start="0x00000000" size="0x00002000" RAMstart="0x1FFFFF00" RAMsize="0x00000400" default="1"/>

          <book name="Documents/KL02P32M48SF0RM.pdf" title="KL02 Sub-Family Reference Manual"/>
          <book name="Documents/KL02P32M48SF0.pdf"   title="KL02 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL02Z16xxx4  ****************************** -->
        <device Dname="MKL02Z16xxx4">
          <compile header="Device/Include/MKL02Z4.h" define="MKL02Z16xxx4"/>
          <debug svd="SVD/MKL02Z4.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x1FFFFE00" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P16_48MHZ.FLM" start="0x00000000" size="0x00004000" RAMstart="0x1FFFFE00" RAMsize="0x00000800" default="1"/>

