taboadaa/ShuQi/nRF/Packages/.cache/Keil.Kinetis_KLxx_DFP.1.13.0.pdsc
          <book name="Documents/KL02P32M48SF0RM.pdf" title="KL02 Sub-Family Reference Manual"/>
          <book name="Documents/KL02P32M48SF0.pdf"   title="KL02 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL02Z32xxx4  ****************************** -->
        <device Dname="MKL02Z32xxx4">
          <compile header="Device/Include/MKL02Z4.h" define="MKL02Z32xxx4"/>
          <debug svd="SVD/MKL02Z4.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x1FFFFC00" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P32_48MHZ.FLM" start="0x00000000" size="0x00008000" RAMstart="0x1FFFFC00" RAMsize="0x00001000" default="1"/>

          <book name="Documents/KL02P32M48SF0RM.pdf" title="KL02 Sub-Family Reference Manual"/>
          <book name="Documents/KL02P32M48SF0.pdf"   title="KL02 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL03Z8xxx4  ****************************** -->
        <device Dname="MKL03Z8xxx4">
          <compile header="Device/Include/MKL03Z4.h" define="MKL03Z8xxx4"/>
          <debug svd="SVD/MKL03Z4.svd"/>
          <memory id="IROM1"                           start="0x00000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                           start="0x1FFFFE00" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P8_48MHZ_KL03.FLM" start="0x00000000" size="0x00002000" RAMstart="0x1FFFFE00" RAMsize="0x800" default="1"/>

          <book name="Documents/KL03P24M48SF0RM.pdf" title="KL03 Sub-Family Reference Manual"/>
          <book name="Documents/KL03P24M48SF0.pdf"   title="KL03 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL03Z16xxx4  ****************************** -->
        <device Dname="MKL03Z16xxx4">
          <compile header="Device/Include/MKL03Z4.h" define="MKL03Z16xxx4"/>
          <debug svd="SVD/MKL03Z4.svd"/>
          <memory id="IROM1"                            start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                            start="0x1FFFFE00" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P16_48MHZ_KL03.FLM" start="0x00000000" size="0x00004000" RAMstart="0x1FFFFE00" RAMsize="0x800" default="1"/>

          <book name="Documents/KL03P24M48SF0RM.pdf" title="KL03 Sub-Family Reference Manual"/>
          <book name="Documents/KL03P24M48SF0.pdf"   title="KL03 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL03Z32xxx4  ****************************** -->
        <device Dname="MKL03Z32xxx4">
          <compile header="Device/Include/MKL03Z4.h" define="MKL03Z32xxx4"/>
          <debug svd="SVD/MKL03Z4.svd"/>
          <memory id="IROM1"                            start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                            start="0x1FFFFE00" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P32_48MHZ_KL03.FLM" start="0x00000000" size="0x00008000" RAMstart="0x1FFFFE00" RAMsize="0x800" default="1"/>

          <book name="Documents/KL03P24M48SF0RM.pdf" title="KL03 Sub-Family Reference Manual"/>
          <book name="Documents/KL03P24M48SF0.pdf"   title="KL03 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL04Z8xxx4  ****************************** -->
        <device Dname="MKL04Z8xxx4">
          <compile header="Device/Include/MKL04Z4.h" define="MKL04Z8xxx4"/>
          <debug svd="SVD/MKL04Z4.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x1FFFFF00" size="0x00000400" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P8_48MHZ.FLM" start="0x00000000" size="0x00002000" RAMstart="0x1FFFFF00" RAMsize="0x00000400" default="1"/>

          <book name="Documents/KL04P48M48SF1RM.pdf" title="KL04 Sub-Family Reference Manual"/>
          <book name="Documents/KL04P48M48SF1.pdf"   title="KL04 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL04Z16xxx4  ****************************** -->
        <device Dname="MKL04Z16xxx4">
          <compile header="Device/Include/MKL04Z4.h" define="MKL04Z16xxx4"/>
          <debug svd="SVD/MKL04Z4.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x1FFFFE00" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P16_48MHZ.FLM" start="0x00000000" size="0x00004000" RAMstart="0x1FFFFE00" RAMsize="0x00000800" default="1"/>

          <book name="Documents/KL04P48M48SF1RM.pdf" title="KL04 Sub-Family Reference Manual"/>
          <book name="Documents/KL04P48M48SF1.pdf"   title="KL04 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL04Z32xxx4  ****************************** -->
        <device Dname="MKL04Z32xxx4">
          <compile header="Device/Include/MKL04Z4.h" define="MKL04Z32xxx4"/>
          <debug svd="SVD/MKL04Z4.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x1FFFFC00" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P32_48MHZ.FLM" start="0x00000000" size="0x00008000" RAMstart="0x1FFFFC00" RAMsize="0x00001000" default="1"/>

          <book name="Documents/KL04P48M48SF1RM.pdf" title="KL04 Sub-Family Reference Manual"/>
          <book name="Documents/KL04P48M48SF1.pdf"   title="KL04 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL05Z8xxx4  ****************************** -->
        <device Dname="MKL05Z8xxx4">
          <compile header="Device/Include/MKL05Z4.h" define="MKL05Z8xxx4"/>
          <debug svd="SVD/MKL05Z4.svd"/>
          <memory id="IROM1"                      start="0x00000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                      start="0x1FFFFF00" size="0x00000400" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P8_48MHZ.FLM" start="0x00000000" size="0x00002000" RAMstart="0x1FFFFF00" RAMsize="0x00000400" default="1"/>

