taboadaa/ShuQi/nRF/Packages/.cache/Keil.Kinetis_KLxx_DFP.1.13.0.pdsc
          <book name="Documents/KL16P80M48SF4RM.pdf" title="KL16 Sub-Family Reference Manual"/>
          <book name="Documents/KL16P64M48SF5.pdf"   title="KL16 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL16Z64xxx4  ****************************** -->
        <device Dname="MKL16Z64xxx4">
          <compile header="Device/Include/MKL16Z4.h" define="MKL16Z64xxx4"/>
          <debug svd="SVD/MKL16Z4.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x1FFFF800" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P64_48MHZ.FLM" start="0x00000000" size="0x00010000" RAMstart="0x1FFFF800" RAMsize="0x00002000" default="1"/>

          <book name="Documents/KL16P80M48SF4RM.pdf" title="KL16 Sub-Family Reference Manual"/>
          <book name="Documents/KL16P64M48SF5.pdf"   title="KL16 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL16Z128xxx4  ****************************** -->
        <device Dname="MKL16Z128xxx4">
          <compile header="Device/Include/MKL16Z4.h" define="MKL16Z128xxx4"/>
          <debug svd="SVD/MKL16Z4.svd"/>
          <memory id="IROM1"                        start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P128_48MHZ.FLM" start="0x00000000" size="0x00020000" RAMstart="0x1FFFF000" RAMsize="0x00004000" default="1"/>

          <book name="Documents/KL16P80M48SF4RM.pdf" title="KL16 Sub-Family Reference Manual"/>
          <book name="Documents/KL16P64M48SF5.pdf"   title="KL16 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL16Z256xxx4  ****************************** -->
        <device Dname="MKL16Z256xxx4">
          <compile header="Device/Include/MKL16Z4.h" define="MKL16Z256xxx4"/>
          <debug svd="SVD/MKL16Z4.svd"/>
          <memory id="IROM1"                        start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x1FFFE000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P256_48MHZ.FLM" start="0x00000000" size="0x00040000" RAMstart="0x1FFFE000" RAMsize="0x00008000" default="1"/>

          <book name="Documents/KL16P80M48SF4RM.pdf" title="KL16 Sub-Family Reference Manual"/>
          <book name="Documents/KL16P64M48SF4.pdf"   title="KL16 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL17Z32xxx4  ****************************** -->
        <device Dname="MKL17Z32xxx4">
          <compile header="Device/Include/MKL17Z644.h" define="MKL17Z32xxx4"/>
          <debug svd="SVD/MKL17Z644.svd"/>
          <memory id="IROM1"                            start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                            start="0x1FFFF800" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P32_48MHZ_KL43.FLM" start="0x00000000" size="0x00008000" RAMstart="0x1FFFF800" RAMsize="0x800" default="1"/>

          <book name="Documents/KL17P64M48SF2RM.pdf" title="KL17 Sub-Family Reference Manual"/>
          <book name="Documents/KL17P64M48SF2.pdf"   title="KL17 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL17Z64xxx4  ****************************** -->
        <device Dname="MKL17Z64xxx4">
          <compile header="Device/Include/MKL17Z644.h" define="MKL17Z64xxx4"/>
          <debug svd="SVD/MKL17Z644.svd"/>
          <memory id="IROM1"                            start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                            start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P64_48MHZ_KL43.FLM" start="0x00000000" size="0x00010000" RAMstart="0x1FFFF000" RAMsize="0x800" default="1"/>

          <book name="Documents/KL17P64M48SF2RM.pdf" title="KL17 Sub-Family Reference Manual"/>
          <book name="Documents/KL17P64M48SF2.pdf"   title="KL17 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL17Z128xxx4  ****************************** -->
        <device Dname="MKL17Z128xxx4">
          <compile header="Device/Include/MKL17Z4.h" define="MKL17Z128xxx4"/>
          <debug svd="SVD/MKL17Z4.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x1FFFE000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P128_48MHZ_KL43.FLM" start="0x00000000" size="0x00020000" RAMstart="0x1FFFF000" RAMsize="0x800" default="1"/>

          <book name="Documents/KL17P64M48SF6RM.pdf" title="KL17 Sub-Family Reference Manual"/>
          <book name="Documents/KL17P64M48SF6.pdf"   title="KL17 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL17Z256xxx4  ****************************** -->
        <device Dname="MKL17Z256xxx4">
          <compile header="Device/Include/MKL17Z4.h" define="MKL17Z256xxx4"/>
          <debug svd="SVD/MKL17Z4.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x1FFFE000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P256_48MHZ_KL43.FLM" start="0x00000000" size="0x00040000" RAMstart="0x1FFFF000" RAMsize="0x800" default="1"/>

          <book name="Documents/KL17P64M48SF6RM.pdf" title="KL17 Sub-Family Reference Manual"/>
          <book name="Documents/KL17P64M48SF6.pdf"   title="KL17 Sub-Family Data Sheet"/>
        </device>
      </subFamily>

      <!-- ******************************  KL2x    ****************************** -->
      <subFamily DsubFamily="KL2x">
        <description>
The Kinetis KL2x is an ultra-low-power MCU family that adds a full-speed USB 2.0 On-the-Go (OTG) controller or a full-speed crystal-less USB 2.0 device controller in addition to the Kinetis KL1x series.
The Kinetis KL2x MCU family is compatible with Kinetis K20 MCUs (based on ARM® Cortex®-M4), and with all other Kinetis KL1x, KL2x, KL3x, and KL4x series MCUs, providing a migration path to lower and higher performance and feature integration.
        </description>

        <!-- ******************************  MKL24Z32xxx4  ****************************** -->
        <device Dname="MKL24Z32xxx4">
          <compile header="Device/Include/MKL24Z4.h" define="MKL24Z32xxx4"/>
          <debug svd="SVD/MKL24Z4.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x1FFFFC00" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P32_48MHZ.FLM" start="0x00000000" size="0x00008000" RAMstart="0x1FFFFC00" RAMsize="0x00001000" default="1"/>

