taboadaa/ShuQi/nRF/Packages/.cache/Keil.Kinetis_KLxx_DFP.1.13.0.pdsc
        <!-- ******************************  MKL27Z32xxx4  ****************************** -->
        <device Dname="MKL27Z32xxx4">
          <compile header="Device/Include/MKL27Z644.h" define="MKL27Z32xxx4"/>
          <debug svd="SVD/MKL27Z644.svd"/>
          <memory id="IROM1"                            start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                            start="0x1FFFF800" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P32_48MHZ_KL43.FLM" start="0x00000000" size="0x00008000" RAMstart="0x1FFFF800" RAMsize="0x800" default="1"/>

          <book name="Documents/KL27P64M48SF2RM.pdf" title="KL27 Sub-Family Reference Manual"/>
          <book name="Documents/KL27P64M48SF2.pdf"   title="KL27 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL27Z64xxx4  ****************************** -->
        <device Dname="MKL27Z64xxx4">
          <compile header="Device/Include/MKL27Z644.h" define="MKL27Z64xxx4"/>
          <debug svd="SVD/MKL27Z644.svd"/>
          <memory id="IROM1"                            start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                            start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P64_48MHZ_KL43.FLM" start="0x00000000" size="0x00010000" RAMstart="0x1FFFF000" RAMsize="0x800" default="1"/>

          <book name="Documents/KL27P64M48SF2RM.pdf" title="KL27 Sub-Family Reference Manual"/>
          <book name="Documents/KL27P64M48SF2.pdf"   title="KL27 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL27Z128xxx4  ****************************** -->
        <device Dname="MKL27Z128xxx4">
          <compile header="Device/Include/MKL27Z4.h" define="MKL27Z128xxx4"/>
          <debug svd="SVD/MKL27Z4.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x1FFFE000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P128_48MHZ_KL43.FLM" start="0x00000000" size="0x00020000" RAMstart="0x1FFFF000" RAMsize="0x800" default="1"/>

          <book name="Documents/KL27P64M48SF6RM.pdf" title="KL27 Sub-Family Reference Manual"/>
          <book name="Documents/KL27P64M48SF6.pdf"   title="KL27 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL27Z256xxx4  ****************************** -->
        <device Dname="MKL27Z256xxx4">
          <compile header="Device/Include/MKL27Z4.h" define="MKL27Z256xxx4"/>
          <debug svd="SVD/MKL27Z4.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x1FFFE000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P256_48MHZ_KL43.FLM" start="0x00000000" size="0x00040000" RAMstart="0x1FFFF000" RAMsize="0x800" default="1"/>

          <book name="Documents/KL27P64M48SF6RM.pdf" title="KL27 Sub-Family Reference Manual"/>
          <book name="Documents/KL27P64M48SF6.pdf"   title="KL27 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL28Z256xxx7  ****************************** -->
        <!--device Dname="MKL28Z256xxx7">
          <compile header="Device/Include/MKL28Z7.h" define="MKL28Z256xxx7"/>
          <debug svd="SVD/MKL28Z7.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x1FFF8000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P256_KL28.FLM" start="0x00000000" size="0x00040000"             default="1"/>
        </device-->

        <!-- ******************************  MKL28Z512xxx7  ****************************** -->
        <device Dname="MKL28Z512xxx7">
          <compile header="Device/Include/MKL28Z7.h" define="MKL28Z512xxx7"/>
          <debug svd="SVD/MKL28Z7.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x80000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x1FFF8000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P512_KL28.FLM" start="0x00000000" size="0x80000"             default="1"/>

          <book name="Documents/MKL28ZRM.pdf"      title="KL28Z Reference Manual"/>
          <book name="Documents/MKL28Z512Vxx7.pdf" title="KL28Zxxx Data Sheet"/>
        </device>
      </subFamily>

      <!-- ******************************  KL3x    ****************************** -->
      <subFamily DsubFamily="KL3x">
        <description>
The Kinetis KL3x MCU family combines ultra-low power performance with a rich suite of analog, communication, timing, and control peripherals for consumer and industrial metering applications.
 - Adds a segment LCD controller option to the Kinetis KL1x series
 - Includes multiple, flexible low power modes including new compute mode that reduces dynamic power by placing peripherals in an asynchronous stop mode
 - Provides a migration path to lower or higher performance and feature integration through compatibility with other Kinetis MCUs
 - Backed by robust development tools and software
        </description>

        <!-- ******************************  MKL33Z32xxx4  ****************************** -->
        <device Dname="MKL33Z32xxx4">
          <compile header="Device/Include/MKL33Z644.h" define="MKL33Z32xxx4"/>
          <debug svd="SVD/MKL33Z644.svd"/>
          <memory id="IROM1"                            start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                            start="0x1FFFFC00" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P32_48MHZ_KL43.FLM" start="0x00000000" size="0x00008000" RAMstart="0x1FFFFC00" RAMsize="0x800" default="1"/>

          <book name="Documents/KL13P80M48SF3RM.pdf" title="KL33 Sub-Family Reference Manual"/>
          <book name="Documents/KL33P80M48SF3.pdf"   title="KL33 Sub-Family Data Sheet"/>
        </device>

