taboadaa/ShuQi/nRF/Packages/.cache/Keil.Kinetis_KLxx_DFP.1.13.0.pdsc
        <!-- ******************************  MKL33Z64xxx4  ****************************** -->
        <device Dname="MKL33Z64xxx4">
          <compile header="Device/Include/MKL33Z644.h" define="MKL33Z64xxx4"/>
          <debug svd="SVD/MKL33Z644.svd"/>
          <memory id="IROM1"                            start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                            start="0x1FFFF800" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P64_48MHZ_KL43.FLM" start="0x00000000" size="0x00010000" RAMstart="0x1FFFF800" RAMsize="0x800" default="1"/>

          <book name="Documents/KL13P80M48SF3RM.pdf" title="KL33 Sub-Family Reference Manual"/>
          <book name="Documents/KL33P80M48SF3.pdf"   title="KL33 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL33Z128xxx4  ****************************** -->
        <device Dname="MKL33Z128xxx4">
          <compile header="Device/Include/MKL33Z4.h" define="MKL33Z128xxx4"/>
          <debug svd="SVD/MKL33Z4.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P128_48MHZ_KL43.FLM" start="0x00000000" size="0x00020000" RAMstart="0x1FFFF000" RAMsize="0x800" default="1"/>

          <book name="Documents/KL33P64M48SF6RM.pdf" title="KL33 Sub-Family Reference Manual"/>
          <book name="Documents/KL33P64M48SF6.pdf"   title="KL33 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL33Z256xxx4  ****************************** -->
        <device Dname="MKL33Z256xxx4">
          <compile header="Device/Include/MKL33Z4.h" define="MKL33Z256xxx4"/>
          <debug svd="SVD/MKL33Z4.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x1FFFE000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P256_48MHZ_KL43.FLM" start="0x00000000" size="0x00040000" RAMstart="0x1FFFE000" RAMsize="0x800" default="1"/>

          <book name="Documents/KL33P64M48SF6RM.pdf" title="KL33 Sub-Family Reference Manual"/>
          <book name="Documents/KL33P64M48SF6.pdf"   title="KL33 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL34Z64xxx4  ****************************** -->
        <device Dname="MKL34Z64xxx4">
          <compile header="Device/Include/MKL34Z4.h" define="MKL34Z64xxx4"/>
          <debug svd="SVD/MKL34Z4.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x1FFFF800" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P64_48MHZ.FLM" start="0x00000000" size="0x00010000" RAMstart="0x1FFFF800" RAMsize="0x00002000" default="1"/>

          <book name="Documents/KL34P100M48SF4RM.pdf" title="KL34 Sub-Family Reference Manual"/>
          <book name="Documents/KL34P100M48SF4.pdf"   title="KL34 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL36Z64xxx4  ****************************** -->
        <device Dname="MKL36Z64xxx4">
          <compile header="Device/Include/MKL36Z4.h" define="MKL36Z64xxx4"/>
          <debug svd="SVD/MKL36Z4.svd"/>
          <memory id="IROM1"                       start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                       start="0x1FFFF800" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P64_48MHZ.FLM" start="0x00000000" size="0x00010000" RAMstart="0x1FFFF800" RAMsize="0x00002000" default="1"/>

          <book name="Documents/KL36P121M48SF4RM.pdf" title="KL36 Sub-Family Reference Manual"/>
          <book name="Documents/KL36P121M48SF4.pdf"   title="KL36 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL36Z128xxx4  ****************************** -->
        <device Dname="MKL36Z128xxx4">
          <compile header="Device/Include/MKL36Z4.h" define="MKL36Z128xxx4"/>
          <debug svd="SVD/MKL36Z4.svd"/>
          <memory id="IROM1"                        start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P128_48MHZ.FLM" start="0x00000000" size="0x00020000" RAMstart="0x1FFFF000" RAMsize="0x00004000" default="1"/>

          <book name="Documents/KL36P121M48SF4RM.pdf" title="KL36 Sub-Family Reference Manual"/>
          <book name="Documents/KL36P121M48SF4.pdf"   title="KL36 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL36Z256xxx4  ****************************** -->
        <device Dname="MKL36Z256xxx4">
          <compile header="Device/Include/MKL36Z4.h" define="MKL36Z256xxx4"/>
          <debug svd="SVD/MKL36Z4.svd"/>
          <memory id="IROM1"                        start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x1FFFE000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P256_48MHZ.FLM" start="0x00000000" size="0x00040000" RAMstart="0x1FFFE000" RAMsize="0x00008000" default="1"/>

          <book name="Documents/KL36P121M48SF4RM.pdf" title="KL36 Sub-Family Reference Manual"/>
          <book name="Documents/KL36P121M48SF4.pdf"   title="KL36 Sub-Family Data Sheet"/>
        </device>
      </subFamily>

      <!-- ******************************  KL4x    ****************************** -->
      <subFamily DsubFamily="KL4x">
        <description>
The Kinetis KL4x MCU family combines ultra-low-power performance with a rich suite of analog, communication, timing and control peripherals (including a segment LCD controller) for applications like electronic scales, flow meters, smart meters, and thermostats.
 - Includes multiple flexible low-power modes, including new compute mode which reduces dynamic power by placing peripherals in an asynchronous stop mode
 - Features security circuitry to prevent unauthorized access to RAM and flash contents
 - Provides a migration path to lower and higher performance and feature integration through compatibility with other Kinetis families
 - Backed by robust development tools and software
        </description>

        <!-- ******************************  MKL43Z64xxx4  ****************************** -->
        <device Dname="MKL43Z64xxx4">
          <compile header="Device/Include/MKL43Z4.h" define="MKL43Z64xxx4"/>
          <debug svd="SVD/MKL43Z4.svd"/>
          <memory id="IROM1"                            start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                            start="0x1FFFF800" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P64_48MHZ_KL43.FLM" start="0x00000000" size="0x00010000" RAMstart="0x1FFFF800" RAMsize="0x800" default="1"/>

          <book name="Documents/KL43P64M48SF6RM.pdf" title="KL43 Sub-Family Reference Manual"/>
          <book name="Documents/KL43P64M48SF6.pdf"   title="KL43 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL43Z128xxx4  ****************************** -->
        <device Dname="MKL43Z128xxx4">
          <compile header="Device/Include/MKL43Z4.h" define="MKL43Z128xxx4"/>
          <debug svd="SVD/MKL43Z4.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P128_48MHZ_KL43.FLM" start="0x00000000" size="0x00020000" RAMstart="0x1FFFF000" RAMsize="0x800" default="1"/>

          <book name="Documents/KL43P64M48SF6RM.pdf" title="KL43 Sub-Family Reference Manual"/>
          <book name="Documents/KL43P64M48SF6.pdf"   title="KL43 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL43Z256xxx4  ****************************** -->
        <device Dname="MKL43Z256xxx4">
          <compile header="Device/Include/MKL43Z4.h" define="MKL43Z256xxx4"/>
          <debug svd="SVD/MKL43Z4.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x1FFFE000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P256_48MHZ_KL43.FLM" start="0x00000000" size="0x00040000" RAMstart="0x1FFFE000" RAMsize="0x800" default="1"/>

          <book name="Documents/KL43P64M48SF6RM.pdf" title="KL43 Sub-Family Reference Manual"/>
          <book name="Documents/KL43P64M48SF6.pdf"   title="KL43 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL46Z128xxx4  ****************************** -->
        <device Dname="MKL46Z128xxx4">
          <compile header="Device/Include/MKL46Z4.h" define="MKL46Z128xxx4"/>
          <debug svd="SVD/MKL46Z4.svd"/>
          <memory id="IROM1"                        start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x1FFFF000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P128_48MHZ.FLM" start="0x00000000" size="0x00020000" RAMstart="0x1FFFF000" RAMsize="0x00004000" default="1"/>

          <book name="Documents/KL46P121M48SF4RM.pdf" title="KL46 Sub-Family Reference Manual"/>
          <book name="Documents/KL46P121M48SF4.pdf"   title="KL46 Sub-Family Data Sheet"/>
        </device>

        <!-- ******************************  MKL46Z256xxx4  ****************************** -->
        <device Dname="MKL46Z256xxx4">
          <compile header="Device/Include/MKL46Z4.h" define="MKL46Z256xxx4"/>
          <debug svd="SVD/MKL46Z4.svd"/>
          <memory id="IROM1"                        start="0x00000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x1FFFE000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P256_48MHZ.FLM" start="0x00000000" size="0x00040000" RAMstart="0x1FFFE000" RAMsize="0x00008000" default="1"/>

          <book name="Documents/KL46P121M48SF4RM.pdf" title="KL46 Sub-Family Reference Manual"/>
          <book name="Documents/KL46P121M48SF4.pdf"   title="KL46 Sub-Family Data Sheet"/>
        </device>
      </subFamily>

      <!-- ******************************  KL8x    ****************************** -->
      <subFamily DsubFamily="KL8x">
        <description>
The Kinetis KL8x MCU expands on the Kinetis low-power MCU portfolio with rich security features including tamper detection, true random number generator and low-power trusted crypto engine supporting AES, DES, 3DES, SHA, RSA and ECC.
        </description>

        <!-- ******************************  MKL82Z128xxx7  ****************************** -->
        <device Dname="MKL82Z128xxx7">
          <compile header="Device/Include/MKL82Z7.h" define="MKL82Z128xxx7"/>
          <debug svd="SVD/MKL82Z7.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x1FFFA000" size="0x00018000" init   ="0" default="1"/>
          <algorithm name="Flash/MK_P128.FLM" start="0x00000000" size="0x00020000"             default="1"/>

          <book name="Documents/KL82P121M72SF0RM.pdf" title="KL82 Sub-Family Reference Manual"/>
          <book name="Documents/KL82P121M72SF0.pdf"   title="KL82 Sub-Family Data Sheet"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- ******************************  KL0x    ****************************** -->
    <condition id="MKL02Z4 CMSIS">
      <description>NXP Kinetis KL02 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL02Z16xxx4"/>
      <accept Dname="MKL02Z32xxx4"/>
      <accept Dname="MKL02Z8xxx4"/>
    </condition>
    <condition id="MKL03Z4 CMSIS">
      <description>NXP Kinetis KL03 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL03Z16xxx4"/>
      <accept Dname="MKL03Z32xxx4"/>
      <accept Dname="MKL03Z8xxx4"/>
    </condition>
