taboadaa/ShuQi/nRF/Packages/.cache/Keil.Kinetis_KLxx_DFP.1.13.0.pdsc
    <condition id="MKL04Z4 CMSIS">
      <description>NXP Kinetis KL04 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL04Z16xxx4"/>
      <accept Dname="MKL04Z32xxx4"/>
      <accept Dname="MKL04Z8xxx4"/>
    </condition>
    <condition id="MKL05Z4 CMSIS">
      <description>NXP Kinetis KL05 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL05Z16xxx4"/>
      <accept Dname="MKL05Z32xxx4"/>
      <accept Dname="MKL05Z8xxx4"/>
    </condition>

    <!-- ******************************  KL1x    ****************************** -->
    <condition id="MKL13Z644 CMSIS">
      <description>NXP Kinetis KL13 48MHz 32/64 KB devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL13Z32xxx4"/>
      <accept Dname="MKL13Z64xxx4"/>
    </condition>
    <condition id="MKL14Z4 CMSIS">
      <description>NXP Kinetis KL14 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL14Z32xxx4"/>
      <accept Dname="MKL14Z64xxx4"/>
    </condition>
    <condition id="MKL15Z4 CMSIS">
      <description>NXP Kinetis KL15 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL15Z128xxx4"/>
      <accept Dname="MKL15Z32xxx4"/>
      <accept Dname="MKL15Z64xxx4"/>
    </condition>
    <condition id="MKL16Z4 CMSIS">
      <description>NXP Kinetis KL16 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL16Z128xxx4"/>
      <accept Dname="MKL16Z32xxx4"/>
      <accept Dname="MKL16Z64xxx4"/>
      <accept Dname="MKL16Z256xxx4"/>
    </condition>
    <condition id="MKL17Z644 CMSIS">
      <description>NXP Kinetis KL17 48MHz 32/64 KB devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL17Z32xxx4"/>
      <accept Dname="MKL17Z64xxx4"/>
    </condition>
    <condition id="MKL17Z4 CMSIS">
      <description>NXP Kinetis KL17 48MHz 128/256 KB devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL17Z128xxx4"/>
      <accept Dname="MKL17Z256xxx4"/>
    </condition>

    <!-- ******************************  KL2x    ****************************** -->
    <condition id="MKL24Z4 CMSIS">
      <description>NXP Kinetis KL24 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL24Z32xxx4"/>
      <accept Dname="MKL24Z64xxx4"/>
    </condition>
    <condition id="MKL25Z4 CMSIS">
      <description>NXP Kinetis KL25 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL25Z128xxx4"/>
      <accept Dname="MKL25Z32xxx4"/>
      <accept Dname="MKL25Z64xxx4"/>
    </condition>
    <condition id="MKL26Z4 CMSIS">
      <description>NXP Kinetis KL26 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL26Z32xxx4"/>
      <accept Dname="MKL26Z64xxx4"/>
      <accept Dname="MKL26Z128xxx4"/>
      <accept Dname="MKL26Z256xxx4"/>
      </condition>
    <condition id="MKL27Z644 CMSIS">
      <description>NXP Kinetis KL27 48MHz 32/64 KB devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL27Z32xxx4"/>
      <accept Dname="MKL27Z64xxx4"/>
    </condition>
    <condition id="MKL27Z4 CMSIS">
      <description>NXP Kinetis KL27 48MHz 128/256 KB devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL27Z128xxx4"/>
      <accept Dname="MKL27Z256xxx4"/>
    </condition>
    <condition id="MKL28Z7 CMSIS">
      <description>NXP Kinetis KL28 75MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <!--accept Dname="MKL28Z256xxx7"/-->
      <accept Dname="MKL28Z512xxx7"/>
    </condition>

    <!-- ******************************  KL3x    ****************************** -->
    <condition id="MKL33Z644 CMSIS">
      <description>NXP Kinetis KL33 48MHz 32/64 KB devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL33Z32xxx4"/>
      <accept Dname="MKL33Z64xxx4"/>
    </condition>
    <condition id="MKL33Z4 CMSIS">
      <description>NXP Kinetis KL33 48MHz 128/256 KB devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL33Z128xxx4"/>
      <accept Dname="MKL33Z256xxx4"/>
    </condition>
    <condition id="MKL34Z4 CMSIS">
      <description>NXP Kinetis KL34 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL34Z64xxx4"/>
    </condition>
    <condition id="MKL36Z4 CMSIS">
      <description>NXP Kinetis KL36 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL36Z128xxx4"/>
      <accept Dname="MKL36Z256xxx4"/>
      <accept Dname="MKL36Z64xxx4"/>
    </condition>

    <!-- ******************************  KL4x    ****************************** -->
    <condition id="MKL43Z4 CMSIS">
      <description>NXP Kinetis KL43 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL43Z128xxx4"/>
      <accept Dname="MKL43Z256xxx4"/>
      <accept Dname="MKL43Z64xxx4"/>
    </condition>
    <condition id="MKL46Z4 CMSIS">
      <description>NXP Kinetis KL46 48MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL46Z128xxx4"/>
      <accept Dname="MKL46Z256xxx4"/>
    </condition>

    <!-- ******************************  KL8x    ****************************** -->
    <condition id="MKL82Z7 CMSIS">
      <description>NXP Kinetis KL82 72MHz devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKL82Z128xxx7"/>
    </condition>
