taboadaa/ShuQi/nRF/Packages/.cache/Keil.Kinetis_KLxx_DFP.1.13.0.pdsc
  <boards>
    <board name="FRDM-KL02Z" vendor="NXP" revision="Rev. B" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="MKL02Z32xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dfamily="KLxx Series" DsubFamily="KL0x"/>
      <description>The FRDM-KL02Z is a development tool for the 48 MHz KL02 sub-familiy of Kinetis microcontrollers.</description>
      <feature type="ODbg"      n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Button"    n="3"/>
      <feature type="LED"       n="1"              name="RGB LED"/>
    </board>

    <board name="FRDM-KL03Z" vendor="NXP" revision="Rev. B" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="MKL03Z32xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dfamily="KLxx Series" DsubFamily="KL0x"/>
      <description>The FRDM-KL03Z is a development tool for the 48 MHz KL03 sub-familiy of Kinetis microcontrollers.</description>
      <feature type="ODbg"      n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Button"    n="3"/>
      <feature type="LED"       n="1"              name="RGB LED"/>
    </board>

    <board name="FRDM-KL25Z" vendor="NXP" revision="Rev. B" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="MKL25Z128xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dfamily="KLxx Series" DsubFamily="KL2x"/>
      <description>The FRDM-KL25Z is a Freedom Development Platform for Kinetis KL14, KL15, KL24, KL25 MCUs.</description>
      <image small="Boards/NXP/FRDM-KL25Z/Documents/FRDM-KL25Z_small.jpg"
             large="Boards/NXP/FRDM-KL25Z/Documents/FRDM-KL25Z_large.jpg"/>
      <book category="overview"  name="http://www.nxp.com/products/software-and-tools/hardware-development-tools/freedom-development-boards/freedom-development-platform-for-kinetis-kl14-kl15-kl24-kl25-mcus:FRDM-KL25Z" title="FRDM-KL25Z Web Page"/>
      <book category="manual"    name="Boards/NXP/FRDM-KL25Z/Documents/FRDM-KL25Z_UM.pdf"   title="User Manual"/>
      <book category="setup"     name="Boards/NXP/FRDM-KL25Z/Documents/FRDM-KL25Z_QSG.pdf"  title="Quick Start Guide"/>
      <feature type="XTAL"      n="8000000"/>
      <feature type="ODbg"      n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Batt"      n="1"              name="CR2032 Battery"/>
      <feature type="Button"    n="1"              name="Reset button"/>
      <feature type="USB"       n="1"              name="Full-Speed USB OTG with USB Standard-B Connector"/>
      <feature type="DIO"       n="76"             name="Arduino R3 compatible I/O connectors"/>
      <feature type="LED"       n="1"              name="Tri-color (RGB) LED"/>
      <feature type="Touch"     n="1"              name="Capacitive Touch Slider"/>
      <feature type="Accelerometer" n="1"          name="MMA8451Q 3-axis digital Accelerometer"/>
      <feature type="FreedomFF"/>
      <debugInterface adapter="OpenSDA"   connector="Mini-USB"/>
    </board>

    <board name="FRDM-KL43Z" vendor="NXP" revision="Rev. B" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="MKL43Z256xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dfamily="KLxx Series" DsubFamily="KL4x"/>
      <description>The FRDM-KL43Z is a development tool for the 48 MHz KL43 sub-familiy of Kinetis microcontrollers.</description>
      <image small="Boards/NXP/FRDM-KL43Z/Documents/FRDM-KL43Z_small.jpg"/>
      <book category="manual"    name="Boards/NXP/FRDM-KL43Z/Documents/FRDMKL43ZUG.pdf"    title="User Manual"/>
      <book category="schematic" name="Boards/NXP/FRDM-KL43Z/Documents/FRDM-KL43Z_SCH.pdf" title="Schematics"/>
      <feature type="Button"     n="3"             name="Push-buttons: Reset, 2x User"/>
      <feature type="LED"        n="3"             name="LEDs: SDA, 2x User"/>
      <feature type="CustomFF"   n="9"  m="8"      name="Individual Port Access"/>
      <feature type="ArduinoFF"  n="1"             name ="Form factor compatible with Arduino"/>
      <feature type="Touch"      n="1"             name="Capacitive touch slider"/>
      <feature type="LCD"        n="1" m="4.7"     name="Segment LCD"/>
      <feature type="PWR"        n="5"             name="USB Powered"/>
      <feature type="ODbg"       n="1"             name="Onboard OpenSDA via USB"/>
    </board>

    <board name="FRDM-KL82Z" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice deviceIndex="0" Dvendor="NXP:11" Dname="MKL81Z128xxx7"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dfamily="KLxx Series" DsubFamily="KL8x"/>
      <description>The FRDM-KL82Z is a development tool for the 72 MHz KL82 sub-familiy of Kinetis microcontrollers.</description>
    </board>

    <board name="TWR-KL28Z72M" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice deviceIndex="0" Dvendor="NXP:11" Dname="MKL28Z512xxx7"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dfamily="KLxx Series" DsubFamily="KL2x"/>
      <description>The TWR-KL28Z72M is a development board for the 72 MHz KL28 sub-familiy of Kinetis microcontrollers.</description>
      <feature type="ODbg"            n="1"        name="Onboard open-standard serial and debug adaptor (OpenSDA)"/>
      <feature type="PWR"             n="5"        name="USB Powered"/>
      <feature type="USB"             n="1"        name="Dual-role USB interface with Micro-AB USB connector"/>
      <feature type="ConnOther"       n="1"        name="General purpose Tower Plug-in (TWRPI) socket"/>
      <feature type="ConnOther"       n="2"        name="Tower connectivity for access to USB, Ethernet, RS232/RS485, CAN, SPI, I²C, Flexbus, etc."/>
      <feature type="Poti"            n="1"/>      
      <feature type="Button"          n="3"/>      
      <feature type="Touch"           n="2"/>      
      <feature type="Accelerometer"   n="1"        name="Three axis accelerometer (MMA78451Q)"/>
      <feature type="LED"             n="4"        name="Four user-controlled status LEDs"/>
      <feature type="TowerFF"         n="1"/>
    </board>

    <board name="TWR-KL43Z48M" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice deviceIndex="0" Dvendor="NXP:11" Dname="MKL43Z256xxx4"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dfamily="KLxx Series" DsubFamily="KL4x"/>
      <description>The TWR-KL43Z48M is a development board for the 48 MHz KL43 sub-familiy of Kinetis microcontrollers.</description>
      <image small="Boards/NXP/TWR-KL43Z48M/Documents/TWR-KL43Z48M_small.jpg"
             large="Boards/NXP/TWR-KL43Z48M/Documents/TWR-KL43Z48M_large.jpg"/>
      <book category="overview"  name="http://www.nxp.com/products/software-and-tools/hardware-development-tools/tower-development-boards/mcu-and-processor-modules/kinetis-modules/kinetis-kl43-kl33-kl27-kl17-48-mhz-mcus-tower-system-module:TWR-KL43Z48M" title="TWR-KL43Z48M Web Page"/>
      <book category="setup"     name="Boards/NXP/TWR-KL43Z48M/Documents/TWRKL43Z48MQSG.pdf"   title="TWR-KL43Z48M Quick Start Guide"/>
      <book category="manual"    name="Boards/NXP/TWR-KL43Z48M/Documents/TWRKL43ZUG.pdf"       title="User Manual"/>
      <book category="schematic" name="Boards/NXP/TWR-KL43Z48M/Documents/TWR-KL43Z48M_SCH.pdf" title="Schematics"/>
      <feature type="ODbg"          n="1"     name="Onboard open-standard serial and debug adaptor (OpenSDA)"/>
      <feature type="PWR"           n="5"     name="USB Powered"/>
      <feature type="USB"           n="1"     name="Dual-role USB interface with Micro-AB USB connector"/>
      <feature type="ConnOther"     n="1"     name="General purpose Tower Plug-in (TWRPI) socket"/>
      <feature type="ConnOther"     n="2"     name="Tower connectivity for access to USB, Ethernet, RS232/RS485, CAN, SPI, I²C, Flexbus, etc."/>
      <feature type="ConnOther"     n="1"     name="Infrared transmit and receive"/>
      <feature type="Poti"          n="1"     name="Potentiometer for ADC measurements"/>      
      <feature type="Button"        n="3"     name="Two user, one Reset push button"/>      
      <feature type="Touch"         n="1"     name="Touch Tower plug-in socket (with TSS only)"/>      
      <feature type="LCD"           n="1"     name="Segment LCD module (TWRPI-SLCD"/>
      <feature type="Accelerometer" n="1"     name="6-Axis Xtrinsic Sensor with Integrated Linear Accelerometer and Magnetometer (FXOS8700CQ) "/>
      <feature type="LED"           n="4"     name="Four user-controlled status LEDs"/>
      <feature type="TowerFF"       n="1"/>
    </board>

    <board name="TWR-KL82Z72M" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="MKL82Z128xxx7"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dfamily="KLxx Series" DsubFamily="KL8x"/>
      <description>The TWR-KL82Z72M is a development board for the 72 MHz KL82 sub-familiy of Kinetis microcontrollers.</description>
    </board>
  </boards>

  <examples>
    <!-- FRDM-KL02Z Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/FRDM-KL02Z/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="FRDM-KL02Z" vendor="NXP"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- FRDM-KL03Z Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/NXP/FRDM-KL03Z/Blinky">
      <description>Blinky example</description>
      <board name="FRDM-KL03Z" vendor="NXP"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

